In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_excel('messy.xlsx', sheet_name = 'test')

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   CUst ID       100 non-null    int64
 1     JOIN% DATE  100 non-null    object
 2   Unnamed: 2    0 non-null      float64
 3   mobiles       100 non-null    int64
 4     FLL NAM     100 non-null    object
dtypes: float64(1), int64(2), object(2)
memory usage: 4.0+ KB

In [10]:
df.head()

,CUst ID,JOIN% DATE,Unnamed: 2,mobiles,FLL NAM
0,1,08/07/19,NaN,84333605993,mIChAel mIcHALek
1,2,09/10/18,NaN,973444062,Andrew Jimenez
2,3,20190630,NaN,338262954,Ann Gow
3,4,2019-09-06 00:00:1567702800,NaN,84966068026,James Chen
4,5,20170812,NaN,84767065885,Dollie Martinez

In [11]:
df.nunique()

CUst ID          90
  JOIN% DATE     98
Unnamed: 2        0
mobiles         100
  FLL NAM       100
dtype: int64

In [3]:
df.drop(['Unnamed: 2'], axis = 1, inplace = True)
df.head()

   CUst ID                   JOIN% DATE      mobiles           FLL NAM
0        1                     08/07/19  84333605993  mIChAel mIcHALek
1        2                     09/10/18    973444062    Andrew Jimenez
2        3                     20190630    338262954           Ann Gow
3        4  2019-09-06 00:00:1567702800  84966068026        James Chen
4        5                     20170812  84767065885   Dollie Martinez

In [4]:
df.columns = ['Cust_id','Join_date','Mobiles','Full_name']

In [5]:
df = df.iloc[:,[0,3,1,2]]
df.head()

   Cust_id         Full_name                    Join_date      Mobiles
0        1  mIChAel mIcHALek                     08/07/19  84333605993
1        2    Andrew Jimenez                     09/10/18    973444062
2        3           Ann Gow                     20190630    338262954
3        4        James Chen  2019-09-06 00:00:1567702800  84966068026
4        5   Dollie Martinez                     20170812  84767065885

In [6]:
df.isnull().sum()

Cust_id      0
Full_name    0
Join_date    0
Mobiles      0
dtype: int64

In [7]:
df.duplicated().sum()

0

In [24]:
df.head()

   Cust_id                    Join_date      Mobiles         Full_name
0        1                     08/07/19  84333605993  mIChAel mIcHALek
1        2                     09/10/18    973444062    Andrew Jimenez
2        3                     20190630    338262954           Ann Gow
3        4  2019-09-06 00:00:1567702800  84966068026        James Chen
4        5                     20170812  84767065885   Dollie Martinez

In [8]:
df['Full_name'] = [x.title() for x in df['Full_name']]
df['Full_name'].values

array(['Michael Michalek', 'Andrew Jimenez', 'Ann Gow', 'James Chen',
       'Dollie Martinez', 'Roger Callender', 'David Liff', 'Ruben Ray',
       'James Demers', 'Andrea Andrews', 'Otis Arnold', 'Elmer Feezell',
       'Kim Biddle', 'Paul Ruper', 'Robin Ledford', 'Solomon Reyna',
       'Beulah Harvey', 'Bryan Temple', 'Anthony Herzog',
       'Barbara Daugherty', 'Angie Davis', 'Laura Beatty', 'Thomas Ward',
       'Juanita Nutter', 'Stephanie Short', 'Charles Garnand',
       'James Johnson', 'James Johnson', 'Tom Faust', 'Christi Molina',
       'Darlene Bartamian', 'Franklin Johnson', 'Lawrence Cummings',
       'Shelby Dexter', 'Valarie Echols', 'Gregory Miele',
       'Joseph Nebergall', 'Melvin Pigg', 'Mark Faria', 'Kevin Stewart',
       'Elizabeth Herrington', 'Ivan Johnson', 'Marta Wong',
       'Drucilla Palmer', 'Michael Fields', 'Paul White', 'John Lowe',
       'Vincent Shone', 'Bok Mcmullen', 'Mary Montague', 'Teresa Story',
       'Roland Johnson', 'Elaine Jones', 'Jane Goad', 'Anthony Robertson',
       'William Collins', 'John Baker', 'Janet Doughty', 'Arthur Branham',
       'Lenny Arnett', 'Judson Seymour', 'Hugo Eckel', 'Eric Lehman',
       'Kyle Duboise', 'Elizabeth Lopez', 'Florence Luallen',
       'Ismael Daniel', 'Brandee Upchurch', 'Sharon Harris', 'Ann Bufkin',
       'Lorretta Douthitt', 'Vernie Thomas', 'Yvette Hayden',
       'Timothy Wiley', 'Charley Lopez', 'Nora Jiggetts', 'Dora Bowser',
       'Lee Rutherford', 'Dennis Repine', 'Roy Bash', 'Blair Austin',
       'Lamont Baucom', 'Frank Seymore', 'Marion Miller',
       'Robert Streater', 'James Wendel', 'Flora Scordato',
       'Mildred Honda', 'Wayne Clemence', 'Tina Rissell', 'Walter Beard',
       'Patricia Coon', 'Miguel Budreau', 'Virgil Moon',
       'Kristen Shanahan', 'Ron Grollimund', 'Daniel Bentley',
       'Eugene Brown', 'Elmer Miller', 'Frances Holland'], dtype=object)

In [10]:
df.head()

   Cust_id         Full_name                    Join_date      Mobiles
0        1  Michael Michalek                     08/07/19  84333605993
1        2    Andrew Jimenez                     09/10/18    973444062
2        3           Ann Gow                     20190630    338262954
3        4        James Chen  2019-09-06 00:00:1567702800  84966068026
4        5   Dollie Martinez                     20170812  84767065885

In [9]:
df['Mobiles'] = df['Mobiles'].astype(str)
df['Mobiles'] = [x if str(x).startswith('84') else '84'+x for x in df['Mobiles']]

In [10]:
df['Join_date']

0                        08/07/19
1                        09/10/18
2                        20190630
3     2019-09-06 00:00:1567702800
4                        20170812
                 ...
95                       20190816
96    2017-08-22 00:00:1503334800
97    2018-02-17 00:00:1518800400
98                       20190612
99                       20190822
Name: Join_date, Length: 100, dtype: object

In [11]:
from datetime import datetime as dt
def date_fix(x):
    if len(x) == 8:
        if x[2] == '/':
            return dt.strptime(x,'%d/%m/%y')
        else:
            return dt.strptime(x,'%Y%m%d')
    else:
        return dt.strptime(x[0:10],'%Y-%m-%d')

In [12]:
df['Join_date'] = df['Join_date'].map(date_fix)
df['Join_date']

0    2019-07-08
1    2018-10-09
2    2019-06-30
3    2019-09-06
4    2017-08-12
        ...
95   2019-08-16
96   2017-08-22
97   2018-02-17
98   2019-06-12
99   2019-08-22
Name: Join_date, Length: 100, dtype: datetime64[ns]

In [13]:
df['Join_date'] = [dt.strftime(x,'%d-%m-%Y') for x in df['Join_date']]

In [14]:
df['Join_date'].head()

0    08-07-2019
1    09-10-2018
2    30-06-2019
3    06-09-2019
4    12-08-2017
Name: Join_date, dtype: object

In [28]:
df.head()

   Cust_id         Full_name   Join_date      Mobiles
0        1  Michael Michalek  08-07-2019  84333605993
1        2    Andrew Jimenez  09-10-2018  84973444062
2        3           Ann Gow  30-06-2019  84338262954
3        4        James Chen  06-09-2019  84966068026
4        5   Dollie Martinez  12-08-2017  84767065885

In [61]:
df['First_name'] = [x[:x.index(' ')] for x in df['Full_name']]

In [59]:
df['Last_name'] = [x[x.rindex(' '):] for x in df['Full_name']]

In [62]:
df['Email'] = df['Last_name'] +  df['First_name'] +  df['Cust_id'].astype(str) + '@yourcompany.com'

In [63]:
df['Email']

0       MichalekMichael1@yourcompany.com
1         JimenezAndrew2@yourcompany.com
2                GowAnn3@yourcompany.com
3             ChenJames4@yourcompany.com
4        MartinezDollie5@yourcompany.com
                     ...
95       GrollimundRon96@yourcompany.com
96       BentleyDaniel97@yourcompany.com
97         BrownEugene98@yourcompany.com
98         MillerElmer99@yourcompany.com
99     HollandFrances100@yourcompany.com
Name: Email, Length: 100, dtype: object

In [64]:
df.drop(['Last_name', 'First_name'], axis = 1, inplace = True)

In [65]:
df.head()

,Cust_id,Full_name,Join_date,Mobiles,Email,email
0,1,Michael Michalek,08-07-2019,84333605993,MichalekMichael1@yourcompany.com,Michael.Michael.1@yourcompany.com
1,2,Andrew Jimenez,09-10-2018,84973444062,JimenezAndrew2@yourcompany.com,Andrew.Andrew.2@yourcompany.com
2,3,Ann Gow,30-06-2019,84338262954,GowAnn3@yourcompany.com,Ann.Ann.3@yourcompany.com
3,4,James Chen,06-09-2019,84966068026,ChenJames4@yourcompany.com,James.James.4@yourcompany.com
4,5,Dollie Martinez,12-08-2017,84767065885,MartinezDollie5@yourcompany.com,Dollie.Dollie.5@yourcompany.com